[
  {"term":"Nodejs",
    "definition":"Программная платформа, основанная на движке V8, превращающая JavaScript из узкоспециализированного языка в язык общего назначения. Node.js добавляет возможность JavaScript взаимодействовать с устройствами ввода-вывода через свой API, написанный на C++, подключать другие внешние библиотеки, написанные на разных языках, обеспечивая вызовы к ним из JavaScript-кода. Node.js применяется преимущественно на сервере, выполняя роль веб-сервера, но есть возможность разрабатывать на Node.js и десктопные оконные приложения и даже программировать микроконтроллеры. В основе Node.js лежит событийно-ориентированное и асинхронное программирование с неблокирующим вводом/выводом."
  },
  {"term":"Микрокомпьютер",
  "definition":"ермин, обозначавший компьютер, выполненный на основе микропроцессора. В таком значении употреблялся с конца 1970-х до конца 1980-х и вышел из употребления в 1990-е годы, когда был вытеснен термином «персональный компьютер», так как размер таких компьютеров стал считаться обычным. С начала 2010-х употребляется в ином значении, а именно снова вошёл в употребление в связи с появившейся популярностью компьютеров, размером с банковскую карту и сопоставимых по мощности с персональными компьютерами предыдущих поколений"},
  {"term":"Raspberry Pi",
    "definition":"Одноплатный компьютер размером с банковскую карту, изначально разработанный как бюджетная система для обучения информатике, но позже получивший более широкое применение и известность. Разрабатывается британской компанией Raspberry Pi Foundation во главе с Эбеном Аптоном. По состоянию на конец 2019 года было продано более 30 миллионов устройств Raspberry Pi."},
  {"term":"Arduino",
      "definition":"Торговая марка аппаратно-программных средств для построения и прототипирования простых систем, моделей и экспериментов в области электроники, автоматики, автоматизации процессов и робототехники."},
  {"term":"Apache HTTP-сервер",
        "definition":" свободный веб-сервер. Apache является кроссплатформенным ПО, поддерживает операционные системы Linux, BSD, Mac OS, Microsoft Windows, Novell NetWare, BeOS. Основными достоинствами Apache считаются надёжность и гибкость конфигурации."},
  {"term":"Nginx",
          "definition":" веб-сервер и почтовый прокси-сервер, работающий на Unix-подобных операционных системах. Начиная с версии 0.7.52 появилась экспериментальная бинарная сборка под Microsoft Windows. Игорь Сысоев начал разработку в 2002 году. Осенью 2004 года вышел первый публично доступный релиз"},
 
          {"term":"Веб-сервер",
            "definition":" сервер, принимающий HTTP-запросы от клиентов, обычно веб-браузеров, и выдающий им HTTP-ответы, как правило, вместе с HTML-страницей, изображением, файлом, медиа-потоком или другими данными."},
         {"term":"Статический сайт ",
            "definition":" сайт, состоящий из статичных html страниц, составляющих единое целое. Содержит в себе текст, изображения, мультимедиа содержимое и HTML-теги. Теги бывают как служебные, предназначенные для обозревателя, так и предназначенные для размещения, формирования внешнего вида и отображения информации."},
            {"term":"Динамический сайт",
              "definition":" сайт, состоящий из динамичных страниц — шаблонов, контента, скриптов и прочего, в большинстве случаев хранящихся на сервере как отдельные ресурсы."},
           {"term":"Ба́за да́нных",
              "definition":" совокупность данных, хранимых в соответствии со схемой данных, манипулирование которыми выполняют в соответствии с правилами средств моделирования данных["},
              {"term":"ВРЕМЯ ОТКЛИКА",
                "definition":"Это период, за который сервер отвечает на пользовательский запрос (скорость загрузки страницы, выдачи поисковых запросов, подсчёта и анализа данных)."},
             {"term":"Запросы в секунду",
                "definition":"Это число запросов, которое успешно обрабатывается за 1 секунду. В этом случае учитываются все возможные варианты взаимодействия пользователя с веб-сервисом: поиск информации, загрузка или выгрузка данных и т. д. "},
                {"term":"Транзакции в секунду",
                  "definition":" Этот показатель отражает число успешно завершённых за единицу времени транзакций, последовательных операций, которые сгруппированы в логическую цепочку."},
               {"term":"Ключевые показатели эффективности (KPI)",
                  "definition":"это система оценки работы и мотивации персонала компании. Ключевые показатели эффективности основаны на измерении количественных результатов сотрудников, прямым образом влияют на оплату труда сотрудников организации и помогают мотивировать персонал компании."},
                  {"term":"Производительность web",
                    "definition":"Производительность в Интернете означает скорость, с которой веб-страницы загружаются и отображаются в веб-браузере пользователя. Оптимизация веб-производительности или оптимизация веб-сайта - это область знаний о повышении веб-производительности."},
                 {"term":"Express",
                    "definition":"фреймворк web-приложений для Node.js, реализованный как свободное и открытое программное обеспечение под лицензией MIT. Он спроектирован для создания веб-приложений и API. Де-факто является стандартным каркасом для Node.js."},

            {"term":"MySQL",
              "definition":" это программное обеспечение для управления базами данных с открытым исходным кодом, которое помогает пользователям хранить, организовывать и в будущем получать данные."}
]
